#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//一、操作符的分类
//算术操作符: +  -  *  /  %
//移位操作符: <<  >>     --- 移动的是二进制位
//位操作符: &  |  ^      --- 也是使用二进制位进行计算
//赋值操作符: =  +=  -=  *=  /=  %=  <<=  >>=  &=  |=  ^=
//单目操作符: !  ++  --   &  *  +  -  ~  sizeof  (类型)
//关系操作符: >  >=  <  <=  ==  !=
//逻辑操作符: &&  ||
//条件操作符: ?  :
//逗号表达式: ,
//下标引用: []
//函数调用: ()
//结构成员访问: .  ->




//二、原码、反码、补码
//正数的原反补相同
//负数的原反补需要计算
//int main()
//{
//	int a = -10;
//	//1 0000000000000000000000000001010 -- 原码
//	//1 1111111111111111111111111110101 -- 反码
//	//1 1111111111111111111111111110110 -- 补码
//	return 0;
//}
//对整数来说，数据在内存中存储的是二进制的补码


//int main()
//{
//	//1 - 1
//	//1 + (-1)
//	//尝试用原码计算
//	//00000000000000000000000000000001  --  1的原码
//	//10000000000000000000000000000001  --  -1的原码
//	//10000000000000000000000000000010  --  -2//err
//
//	//尝试使用补码
//	//00000000000000000000000000000001  --  1的补码
//	//11111111111111111111111111111111  --  -1的补码
//	//100000000000000000000000000000000  --  丢失最高位，==0
//	return 0;
//}




//三、移位操作符
// << 左移操作符
// >> 右移操作符
//移位操作符的操作数只能是整数
//int main()
//{
//	//左移操作符
//	//移动的是存储在内存中的二进制位
//	//左边抛弃，右边补0
//	int a = 10;
//	int b = a << 1;
//	//00000000000000000000000000001010  --  a的补码
//	//00000000000000000000000000010100  --  b==20
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	int b = a << 1;
//	//11111111111111111111111111111111  --  a的补码
//	//11111111111111111111111111111110  --  b的补码
//	//10000000000000000000000000000001  --  b的反码
//	//10000000000000000000000000000010  --  b的原码 == -2
//	printf("b = %d\n", b);
//	return 0;
//}


//int main()
//{
//	//右移操作符
//	//逻辑右移：左边用0填充，右边丢弃
//	//算数右移：左边用原该值的符号位填充，右边丢弃
//	//右移到底采用算术右移还是逻辑右移是取决于编译器的，通常采用的都是算术右移
//	int a = -10;
//	int b = a >> 1;
//	//11111111111111111111111111110110  --  a的补码
//	//11111111111111111111111111111011  --  b的补码
//	//10000000000000000000000000000100  --  b的反码
//	//10000000000000000000000000000101  --  b的原码 == -5
//	printf("b = %d\n", b);
//	return 0;
//}




//四、位操作符
// &与   |或   ^异或   ~取反
//int main()
//{
//	int a = 6;
//	int b = -7;
//	int c = a & b;
//	//00000000000000000000000000000110  --  a的补码
//	//11111111111111111111111111111001  --  b的补码
//	//11111111111111111111111111111111  --  a&b == 0
//	printf("c=%d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 6;
//	int b = -7;
//	int c = a | b;
//	//00000000000000000000000000000110  --  a的补码
//	//11111111111111111111111111111001  --  b的补码
//	//11111111111111111111111111111111  --  c的补码
//	//10000000000000000000000000000000  --  c的反码
//	//10000000000000000000000000000001  --  c的原码 == -1
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 6;
//	int b = -7;
//	int c = a ^ b;
//	//00000000000000000000000000000110  --  a的补码
//	//11111111111111111111111111111001  --  b的补码
//	//11111111111111111111111111111111  --  c的补码
//	//10000000000000000000000000000000  --  c的反码
//	//10000000000000000000000000000001  --  c的原码 == -1
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	//00000000000000000000000000000000  --  a的补码
//	//11111111111111111111111111111111  --  按位取反，补码
//	//10000000000000000000000000000000  --  反码
//	//10000000000000000000000000000001  --  原码 == -1
//	printf("%d\n", ~a);
//	return 0;
//}


//面试题：不能创建临时变量，实现两个整数的交换
//写法1：
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d,b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后：a=%d,b=%d\n", a, b);
//	return 0;
//}


//写法2：
// a^a=0   0^a=a   a^a^b=b   a^b^a=b   异或是支持交换律的
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d, b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;//a^b^b == a
//	a = a ^ b;//a^b^a == b
//	printf("交换后：a=%d, b=%d\n", a, b);
//	return 0;
//}


//练习：编写代码实现，求一个整数存储在内存中二进制1的个数
//写法1：
//int count_bit_one(int n)
//{
//	int count = 0;
//	while (n)
//	{
//		if ((n % 2) == 1)
//		{
//			count++;
//		}
//		n = n / 2;
//	}
//	return count;
//}
//写法2：
//int count_bit_one(int n)
//{
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if ((n >> i) & 1 == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}
//写法3：
//int count_bit_one(int n)
//{
//	int count = 0;
//	while (n)
//	{
//		n = n & (n - 1);
//		count++;
//	}
//	return count;
//}
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}




//五、逗号表达式
//从左向右执行，因为前面表达式的计算可能会影响后面的，返回最后一个表达式的值
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);//逗号表达式
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	//逗号表达式也可以用在if语句
//	if (a = b + 1, c = a / 2, d > 0)
//	{
//		//业务处理
//	}
//	return 0;
//}




//六、下标访问[]，函数调用()
//1.下标访问
//int main()
//{
//	int arr[10] = { 1,2,3,4,5 };
//
//	int m = arr[4];//数组中下标是4的元素
//	// [] --- 下标引用操作符 --- 操作数是: arr,4
//
//	printf("%d\n", m);
//	return 0;
//}


//2.函数调用
//int Add(int x, int y)
//{
//	return x + y;
//}
//int main()
//{
//	printf("hehe\n");
//	printf("%d\n", 100);
//	int ret = Add(3, 5);// () 就是函数调用操作符，操作数是：Add,3,5
//	//函数调用操作符最少有1个操作符，就是函数名
//	return 0;
//}




//七、结构成员访问操作符
//1.结构体
//结构是一些值的集合，这些值称为成员变量
//结构的每个成员可以是不同类型的变量，如：数组，变量，指针，甚至是其他结构体
//学生类型
//struct Student
//{
//	//成员变量
//	char name[20];
//	int age;
//	float score;
//};
//int main()
//{
//	struct Student s1 = { "张三",20,98.0 };
//	struct Student s2 = { "李四",18,69.8 };
//	return 0;
//}


//2.结构体成员访问操作符
//struct Student
//{
//	//成员变量
//	char name[20];
//	int age;
//	float score;
//};
//int main()
//{
//	struct Student s1 = { "张三",20,98.0 };
//	struct Student s2 = { "李四",18,69.8 };
//	
//	//结构体变量.结构体成员名   .就是结构体成员访问操作符
//	printf("%s", s1.name);
//	return 0;
//}




//八、表达式求值
//1.整型提升
//表达式中的字符和短整型操作数在使用之前被转换成普通类型，这种转换称为整型提升
//有符号整数提升是按照变量数据类型的符号位来提升的
//无符号整数提升，高位补0
int main()
{
	char a = 20;
	//00000000000000000000000000010100 -- 补码
	//00010100 -- 截断8位存入a中

	char b = 130;
	//00000000000000000000000010000010 -- 补码
	//10000010 -- 截断8位存入b中

	char c = a + b;
	//00000000000000000000000000010100 -- a
	//11111111111111111111111110000010 -- b
	//11111111111111111111111110010110 -- a+b -- 补码
	//10010110 -- 截断8位存入c
	//%d打印有符号整数
	//11111111111111111111111110010110 -- c整型提升 -- 补码
	//10000000000000000000000001101010 -- 原码 == - 106

	printf("%d\n", c);
	return 0;
}